In [1]:
import pandas as pd
import numpy as np
from numpy.random import randn as rn

### Creating Random Dataset for pandas dataframe using numpy

In [2]:
rn(7,3) ## random dataset of 7 rows and 3 cols

array([[-0.44604599,  0.08557081,  0.64925272],
       [ 0.48110565,  0.76460452,  1.42645418],
       [-0.2382815 ,  0.41531721,  0.99893495],
       [ 1.72839988, -0.33278044, -0.55356467],
       [ 1.62295424,  1.01138443,  1.37342444],
       [ 0.17736254,  0.88854634,  1.06412494],
       [-1.4323139 , -1.21978744, -0.29438682]])

In [3]:
np.random.seed(1111111)
r=rn(4,3) ## random data of 4 rows and 3 cols
r

array([[ 0.79770476, -1.02648433,  0.33820659],
       [-0.73325503,  1.74920775,  0.21591074],
       [-0.7810557 ,  0.53766997, -0.907037  ],
       [ 1.2727832 ,  1.68404563, -0.78652002]])

In [4]:
pd.DataFrame(r) ## Converting Numpy array to Dataframe

          0         1         2
0  0.797705 -1.026484  0.338207
1 -0.733255  1.749208  0.215911
2 -0.781056  0.537670 -0.907037
3  1.272783  1.684046 -0.786520

In [5]:

row=["a","b","c","d"]
col=["x","y","z"]

In [6]:
rdf=pd.DataFrame(r,index=row,columns=col)

In [7]:
rdf

          x         y         z
a  0.797705 -1.026484  0.338207
b -0.733255  1.749208  0.215911
c -0.781056  0.537670 -0.907037
d  1.272783  1.684046 -0.786520

In [8]:
### Above code is just to create some random dataset for this exercise

In [9]:
rdf[["x","y"]]

          x         y
a  0.797705 -1.026484
b -0.733255  1.749208
c -0.781056  0.537670
d  1.272783  1.684046

### .loc is actual location

In [10]:
rdf.loc[["b"],["y"]]  #### rdf.loc[[Row info],[ col info] ]

          y
b  1.749208

In [11]:
rdf

          x         y         z
a  0.797705 -1.026484  0.338207
b -0.733255  1.749208  0.215911
c -0.781056  0.537670 -0.907037
d  1.272783  1.684046 -0.786520

try to print 0.537670

In [11]:
rdf.loc[["c"],["y"]]

         y
c  0.53767

### iloc is int location

In [12]:
rdf

          x         y         z
a  0.797705 -1.026484  0.338207
b -0.733255  1.749208  0.215911
c -0.781056  0.537670 -0.907037
d  1.272783  1.684046 -0.786520

In [13]:
rdf.iloc[[1],[1]]

          y
b  1.749208

### Difference between loc and iloc 

Loc - > it takes actual index and col values 

Iloc - > It uses integer indexing

In [14]:
rdf

          x         y         z
a  0.797705 -1.026484  0.338207
b -0.733255  1.749208  0.215911
c -0.781056  0.537670 -0.907037
d  1.272783  1.684046 -0.786520

try to print 0.537670 ## using iloc

In [15]:
rdf.iloc[[2],[1]]  ### dataframe.iloc[[row_info],[Col_info]]

         y
c  0.53767

In [16]:
##rdf.loc[[2],[1]]
 # You will get error as it uses actual location

In [17]:
##rdf.iloc[["c"],["y"]] ## it only takes numeric index
## above code will give error

In [18]:
rdf

          x         y         z
a  0.797705 -1.026484  0.338207
b -0.733255  1.749208  0.215911
c -0.781056  0.537670 -0.907037
d  1.272783  1.684046 -0.786520

In [19]:
rdf[0:3] ### dataframe[start : end before]

          x         y         z
a  0.797705 -1.026484  0.338207
b -0.733255  1.749208  0.215911
c -0.781056  0.537670 -0.907037

In [12]:
rdf

          x         y         z
a  0.797705 -1.026484  0.338207
b -0.733255  1.749208  0.215911
c -0.781056  0.537670 -0.907037
d  1.272783  1.684046 -0.786520

In [13]:
rdf.iloc[:,1:2]

          y
a -1.026484
b  1.749208
c  0.537670
d  1.684046

In [27]:
rdf.iloc[::,0:2]  ## If you want to print all rows but few cols use :: in rows and specify col after ,

          x         y
a  0.797705 -1.026484
b -0.733255  1.749208
c -0.781056  0.537670
d  1.272783  1.684046

In [28]:
rdf.iloc[::-1,0:2]  ## -1 reversed the rows

          x         y
d  1.272783  1.684046
c -0.781056  0.537670
b -0.733255  1.749208
a  0.797705 -1.026484

In [30]:
rdf.iloc[::-1,::-1] ## ::-1 is reverse

          z         y         x
d -0.786520  1.684046  1.272783
c -0.907037  0.537670 -0.781056
b  0.215911  1.749208 -0.733255
a  0.338207 -1.026484  0.797705

In [32]:
rdf

          x         y         z
a  0.797705 -1.026484  0.338207
b -0.733255  1.749208  0.215911
c -0.781056  0.537670 -0.907037
d  1.272783  1.684046 -0.786520

In [31]:
rdf.iloc[::-1,:-1] ### ::-1 means print all the rows in reverse order and :-1 means start from 0th col and end before last col

          x         y
d  1.272783  1.684046
c -0.781056  0.537670
b -0.733255  1.749208
a  0.797705 -1.026484

In [33]:
rdf.iloc[::-1,:2]### ::-1 means print all the rows in reverse order and :-1 means start from 0th col and end before 2nd col

          x         y
d  1.272783  1.684046
c -0.781056  0.537670
b -0.733255  1.749208
a  0.797705 -1.026484

In [34]:
rdf

          x         y         z
a  0.797705 -1.026484  0.338207
b -0.733255  1.749208  0.215911
c -0.781056  0.537670 -0.907037
d  1.272783  1.684046 -0.786520

In [35]:
rdf.iloc[0] ## it prints first row

x    0.797705
y   -1.026484
z    0.338207
Name: a, dtype: float64

In [36]:
rdf.loc["a"]

x    0.797705
y   -1.026484
z    0.338207
Name: a, dtype: float64

 Practise this loc & iloc

## Conditions on Pandas DataFrame

In [40]:
rdf

          x         y         z
a  0.797705 -1.026484  0.338207
b -0.733255  1.749208  0.215911
c -0.781056  0.537670 -0.907037
d  1.272783  1.684046 -0.786520

In [39]:
rdf > 1 ## this condition is applied to complete DF

       x      y      z
a  False  False  False
b  False   True  False
c  False  False  False
d   True   True  False

In [41]:
rdf[rdf > 1] ### dataframe [ Condition ]

          x         y   z
a       NaN       NaN NaN
b       NaN  1.749208 NaN
c       NaN       NaN NaN
d  1.272783  1.684046 NaN

In [42]:
rdf.loc[["a","b","c"]] >1 ## this condition is only applied to row a,b,c

       x      y      z
a  False  False  False
b  False   True  False
c  False  False  False

In [43]:
rdf[rdf.loc[["a","b","c"]] >1] ## show me the values which are greater than 1 in only rows a,b,c

    x         y   z
a NaN       NaN NaN
b NaN  1.749208 NaN
c NaN       NaN NaN
d NaN       NaN NaN

In [ ]:
## Try above using iloc

In [46]:
rdf.iloc[0:3,::] > 1

       x      y      z
a  False  False  False
b  False   True  False
c  False  False  False

In [49]:
rdf[rdf.iloc[0:3,::] > 1] ## from complete dataframe only check 1st three rows if it has any value greater than 1 then print it

    x         y   z
a NaN       NaN NaN
b NaN  1.749208 NaN
c NaN       NaN NaN

In [48]:
rdf[rdf.iloc[0:3] > 1]

    x         y   z
a NaN       NaN NaN
b NaN  1.749208 NaN
c NaN       NaN NaN
d NaN       NaN NaN

In [50]:
rdf[rdf.iloc[0:3,::] > 1].iloc[0:3]  ## from complete dataframe only check 1st three rows if it has any value 
                                      #greater than 1 then print only those 1st 3 rows

    x         y   z
a NaN       NaN NaN
b NaN  1.749208 NaN
c NaN       NaN NaN

In [52]:
df1=rdf[rdf.iloc[0:3,::] > 1]
print(df1)
df2=df1.iloc[0:3]
print(df2)

## above code is similar but we are doing the operation in the single line of code

    x         y   z
a NaN       NaN NaN
b NaN  1.749208 NaN
c NaN       NaN NaN
d NaN       NaN NaN
    x         y   z
a NaN       NaN NaN
b NaN  1.749208 NaN
c NaN       NaN NaN

In [55]:
rdf[rdf.iloc[0:3,::] > 1].iloc[0:3].shape[1] ### This code looks complex 
                                            ## start breaking code from left to right
    ##rdf[rdf.iloc[0:3,::] > 1] : going through first 3 rows to find out if value is greater than 1 (Now result of this will be given to next)
    ##.iloc[0:3] : ## print first 3 rows
    ## .shape[1] : ## check the shape of it, 1 means show me col count
    
## if you write downn pandas code in this way it will save time and also memory 
## to write down this type of code it will take time

3

In [56]:
rdf

          x         y         z
a  0.797705 -1.026484  0.338207
b -0.733255  1.749208  0.215911
c -0.781056  0.537670 -0.907037
d  1.272783  1.684046 -0.786520

In [57]:
rdf[(rdf["x"]>1) & (rdf["y"] > 1) ] ## print the rows where both x & y col has value > 1

          x         y        z
d  1.272783  1.684046 -0.78652

In [58]:
rdf[(rdf["x"]>1) | (rdf["y"] > 1) ] ## print the rows where any one col from  x & y  has value > 1

          x         y         z
b -0.733255  1.749208  0.215911
d  1.272783  1.684046 -0.786520

In [59]:
rdf[(rdf["x"]>1) | (rdf["y"] > 1) ] [["x","y"]]

          x         y
b -0.733255  1.749208
d  1.272783  1.684046

In [61]:
df1=rdf[(rdf["x"]>1) | (rdf["y"] > 1) ]
print(df1)
df2=df1 [["x","y"]]
print(df2)

          x         y         z
b -0.733255  1.749208  0.215911
d  1.272783  1.684046 -0.786520
          x         y
b -0.733255  1.749208
d  1.272783  1.684046

In [63]:
rdf[(rdf["x"]>1) | (rdf["y"] > 1) ]

          x         y         z
b -0.733255  1.749208  0.215911
d  1.272783  1.684046 -0.786520

In [65]:
 rdf[["x","y"]][(rdf["x"]>1) | (rdf["y"] > 1) ]

          x         y
b -0.733255  1.749208
d  1.272783  1.684046

In [66]:
 rdf[["x","y"]][(rdf["x"]>1) & (rdf["y"] > 1) ]

          x         y
d  1.272783  1.684046

In [ ]:
## Practise it dont be scared !! with the help of practise you will get this

In [67]:
 rdf[["x","y"]]

          x         y
a  0.797705 -1.026484
b -0.733255  1.749208
c -0.781056  0.537670
d  1.272783  1.684046

In [68]:
 rdf[["x","y"]][(rdf["x"]>1) | (rdf["y"] > 1) ]

          x         y
b -0.733255  1.749208
d  1.272783  1.684046

In [70]:
 rdf[["x","y"]][~(rdf["x"]>1) | ~(rdf["y"] > 1) ]

          x         y
a  0.797705 -1.026484
b -0.733255  1.749208
c -0.781056  0.537670

In [71]:
rdf

          x         y         z
a  0.797705 -1.026484  0.338207
b -0.733255  1.749208  0.215911
c -0.781056  0.537670 -0.907037
d  1.272783  1.684046 -0.786520

In [72]:
rdf.set_index("z")

                  x         y
z
 0.338207  0.797705 -1.026484
 0.215911 -0.733255  1.749208
-0.907037 -0.781056  0.537670
-0.786520  1.272783  1.684046

In [73]:
rdf

          x         y         z
a  0.797705 -1.026484  0.338207
b -0.733255  1.749208  0.215911
c -0.781056  0.537670 -0.907037
d  1.272783  1.684046 -0.786520

In [74]:
rdf.set_index("z",inplace = True)

In [75]:
rdf

                  x         y
z
 0.338207  0.797705 -1.026484
 0.215911 -0.733255  1.749208
-0.907037 -0.781056  0.537670
-0.786520  1.272783  1.684046

In [76]:
rdf.index

Float64Index([0.33820659084449056, 0.21591074346730782, -0.9070370006747239,
              -0.7865200210276713],
             dtype='float64', name='z')

In [78]:
#rdf.loc[0.338207]

In [79]:
rdf.loc[0.33820659084449056]

x    0.797705
y   -1.026484
Name: 0.33820659084449056, dtype: float64

In [80]:
rdf

                  x         y
z
 0.338207  0.797705 -1.026484
 0.215911 -0.733255  1.749208
-0.907037 -0.781056  0.537670
-0.786520  1.272783  1.684046

In [82]:
rdf.reset_index(inplace = True,drop = True) ##  click inside  ( ) and prest shift + tab to see docstring (Function Description)

In [83]:
rdf

          x         y
0  0.797705 -1.026484
1 -0.733255  1.749208
2 -0.781056  0.537670
3  1.272783  1.684046